app/controllers/subtitles_controller.rb

SELECT "subtitles".* FROM "subtitles" WHERE (UPPER(title) LIKE '%G%')
---
	def all
		@subtitles = Subtitle.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "subtitles".* FROM "subtitles" WHERE "subtitles"."user_id" = ?  [["user_id", 1]]
---
	def index
		@user = User.find params[:user_id]
		@subtitles = @user.subtitles.all

SELECT  "subtitles".* FROM "subtitles" WHERE "subtitles"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@subtitle = Subtitle.find(params[:id])

SELECT  "subtitles".* FROM "subtitles" WHERE "subtitles"."title" = ? LIMIT 1  [["title", "Test"]]
---
	def search
		@subtitles = Subtitle.where(title: params[:title]) || []

INSERT INTO "subtitles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Game of Thrones - Winter is Coming"], ["description", "Season 1, Episode 1"], ["created_at", "2015-07-30 15:31:13.402213"], ["updated_at", "2015-07-30 15:31:13.402213"]]
---
	def create
		@subtitle = Subtitle.new(subtitle_params)
		if @subtitle.valid?
      @subtitle.save